import { Children, createContext, useCallback, useContext, useState } from "react";

const gameContext = createContext();

export const GameProvider = ({ children }) => {
  const commonCards = [
    "Скелеты",
    "Огненый дух",
    "Электрический дух",
    "Ледяной дух",
    "Гоблины",
    "Гоблины-копейщики",
    "Подрывник",
    "Летучие мыши",
    "Разряд",
    "Гигантский снежок",
    "Берсеркша",
    "Рыцарь",
    "Лучницы",
    "Миньоны",
    "Стрелы",
    "Пушка",
    "Банда гоблинов",
    "Бочка со скелетами",
    "Огненая лучница",
    "Королевская почта",
    "Костяные драконы",
    "Мортира",
    "Тесла",
    "Варвары",
    "Орда миньонов",
    "Разбойники",
    "Королевский гигант",
    "Элитные варвары",
    "Королевские рекруты",
  ];

  const rareCards = [
    "Дух исцеления",
    "Ледяной голем",
    "Подозрительный куст",
    "Надгробие",
    "Мегаминьон",
    "Гоблин с дротиками",
    "Землятресение",
    "Элексирный голем",
    "Мушкетер",
    "Мини П.Е.К.К.А.",
    "Хижина гоблинов",
    "Адская башня",
    "Валькирия",
    "Гигант",
    "Всадник на кабане",
    "Три мушкетёра",
    "Огненный шар",
    "Ракета",
    "Сборщик эликсира",
    "Печь",
    "Боевой таран",
    "Клетка с гоблином",
    "Башня-бомбежка",
    "Летучка",
    "Целительница-воин",
    "Гоблин-подрывник",
    "Колдун",
    "Королевские кабаны",
    "Хижина варваров",
    "Мини-генераторы",
  ];

  const epicCards = [
    "Ведьма",
    "Принц",
    "Дракончик",
    "П.Е.К.К.А.",
    "Голем",
    "Стражи",
    "Гигантский скелет",
    "Заморозка",
    "Молния",
    "Яд",
    "Клон",
    "Торнадо",
    "Варварская бочка",
    "Арбалет",
    "Зеркало",
    "Стенобои",
    "Ярость",
    "Проклятие гоблинов",
    "Армия скелетов",
    "Гоблинская бочка",
    "Бездна",
    "Темный принц",
    "Руническая гигантша",
    "Охотник",
    "Гоблинский бур",
    "Шар",
    "Электродракон",
    "Вышибала",
    "Палачь",
    "Повозка с пушкой",
    "Гоблин-гигант",
    "Электрогигант",
  ];

  const legendCards = [
    "Бандитка",
    "Дровосек",
    "Шахтёр",
    "Ледяной колдун",
    "Королевский призрак",
    "Громовержец",
    "Феникс",
    "Мегарыцарь",
    "Бревно",
    "Кладбище",
    "Принцесса",
    "Рыбак",
    "Пламенный дракон",
    "Магический лучник",
    "Ночная ведьма",
    "Ведьмина бабушка",
    "Всадница на баране",
    "Гоблинская машина",
    "Спарки",
    "Императрица духов",
    "Адская гончая",
  ];

  const championCards = [
    "Королева лучниц",
    "Монах",
    "Золотой рыцарь",
    "Король скелетов",
    "Главная бандитка",
    "Шустрый шахтер",
    "Маленький принц",
    "Гоблинштейн",
  ];

  const towerTrops = [
    "Прицесса из башни",
    "Канонир",
    "Графиня с кинжалами",
    "Королевский повар",
  ];

  const every = [
    ...commonCards,
    ...rareCards,
    ...epicCards,
    ...legendCards,
    ...championCards,
    ...towerTrops,
  ];

  const spells = [
    "Стрелы",
    "Огненный шар",
    "Молния",
    "Ракета",
    "Заморозка",
    "Яд",
    "Бревно",
    "Торнадо",
    "Клон",
    "Исцеление",
    "Землетрясение",
    "Варварская бочка",
    "Разряд",
    "Кладбище",
    "Зеркало",
    "Ярость",
    "Проклятие гоблинов",
    "Гоблинская бочка",
    "Бездна",
  ];

  const buildings = [
    "Гоблинский бур",
    "Хижина варваров",
    "Башня-бомбежка",
    "Пушка",
    "Тесла",
    "Мортира",
    "Арбалет",
    "Сборщик эликсира",
    "Печь",
    "Клетка с гоблином",
  ];

  const [userValue, setUserValue] = useState([]);

  const addUserValue = useCallback((thing) => {
    setUserValue((prevUserValue) => [...prevUserValue, thing]);
  }, []);

  const showEvery = useCallback(() => {
    setUserValue([...every]);
  }, []);

  const reset = useCallback(() => {
    setUserValue([]);
  }, []);

  const value = {
    reset,
    showEvery,
    towerTrops,
    userValue,
    addUserValue,
    every,
    commonCards,
    rareCards,
    epicCards,
    legendCards,
    championCards,
    spells,
    buildings,
  };

  return <gameContext.Provider value={value}>{children}</gameContext.Provider>;
};

export const useGame = () => {
  return useContext(gameContext);
};
